-- Movie
INSERT INTO "public"."movie"
    ("user_id", "user_name", "title", "overview", "genre", "youtube_title_id", "grinning_score")
VALUES
    ('user_id_1', 'user_name_1', 'マトリックス レザレクションズ', 'この冬、マトリックスが世界を変える！主演キアヌ・リーブスが人生をかけて挑む、全世界で空前の社会現象を巻き起こした今世紀最大のアクション超大作新章！', 'アクション映画', '8PwqzRR3Oo0', 500),
    ('user_id_2', 'user_name_2', 'ジョーカー', '「どんな時も笑顔で人々を楽しませなさい」という母の言葉を胸にコメディアンを夢見る、孤独だが心優しいアーサー。', 'ミステリー映画', 'C3nQcMM5fS4', 200),
    ('user_id_3', 'user_name_3', 'ダークナイト', 'アメコミ映画を変えた、あの伝説を劇場で体感せよ！', 'アクション映画', '2gnl7JxTC0g', 300),
    ('user_id_4', 'user_name_4', 'インターステラー', 'クリストファー・ノーラン監督待望の最新作『インターステラー』は、新たに発見された宇宙のワームホールを利用し、惑星間を旅する人類の限界を超越した冒険を追っていくストーリーが描かれる。ノーランの原案と、ジョナサン・ノーランの既存の脚本を融合させたプロットを基に、最終的な脚本が作られた。', 'ファンタジー映画', 'qZZ9jRan9eo', NULL),
    ('user_id_1', 'user_name_1', 'コーダ　あいのうた', '耳の不自由な家族の中で唯一耳が聞こえる少女が歌の才能を認められたことをきっかけに、夢と現実のはざまで葛藤するドラマ。', '恋愛映画', 'JF7GR2UMmtk', 100),
    ('user_id_1', 'user_name_1', '東京リベンジャーズ', 'アニメ化もされた、和久井健のコミック「東京卍リベンジャーズ」を原作にしたSFアクション。', 'その他', 'TRziJGzIg-U', 100),
    ('user_id_2', 'user_name_2', '嘘喰い', '嘘を見破れなければ、即死。 史上最恐の騙し合いゲーム、開宴！', 'その他', 'eqMCl2RKxJ4', NULL),
    ('user_id_3', 'user_name_3', 'アンチャーテッド', '映画『アンチャーテッド』2022年全国の映画館で公開！', 'アドベンチャー映画', 'Me5Cgw32R2E', 150),
    ('user_id_4', 'user_name_4', 'ノイズ', '藤原竜也×松山ケンイチが殺人の共犯者に！', 'ホラー映画', 'JK5HdjF5rq0', 200),
    ('user_id_4', 'user_name_4', 'エターナルズ', '＜アベンジャーズ＞の後を継ぐ、最強ヒーローチーム＜エターナルズ＞始動', 'アクション映画', 'OIDbp-u7Qmo', 120),
    ('user_id_2', 'user_name_2', 'スパイダーマン：ノー・ウェイ・ホーム', '世界中にスパイダーマンであることを明かされたピーター・パーカー。ドクター・ストレンジはピーターから頼まれ、人々のピーターがスパイダーマンだという記憶を消す呪文を唱えるが、時空が歪みを引き起こしてしまう……　それによりマルチバースが出現。それぞれのユニバースから、スパイダーマンの敵を呼び寄せてしまう。', 'アクション映画', '-XT5bbq6CU4', 1200),
    ('user_id_3', 'user_name_3', 'モービウス', '天才的な頭脳を持つ医師マイケル・モービウス。', 'ホラー映画', '_9VE25sH3Y0', 200),
    ('user_id_1', 'user_name_1', 'ザ・ロストシティ', '主演サンドラ・ブロック、共演チャニング・テイタム、ダニエル・ラドクリフ、ブラッド・ピットとハリウッドが誇る豪華スター競演。予測不能！「謎解きアドベンチャー」大作が爆誕！', 'アドベンチャー映画', '6SloHSQ3lA4', 300),
    ('user_id_1', 'user_name_1', 'インセプション', '劇場公開10周年記念！犯罪現場は、お前の頭の中。', 'ミステリー映画', 'GfnyDtiXfns', 200),
    ('user_id_2', 'user_name_2', 'ダンケルク', '世界が嫉妬する才能ノーラン監督が実話に挑む究極の映像体験。', 'アクション映画', 't5H7ihzcUNs', 400),
    ('user_id_2', 'user_name_2', 'あと1センチの恋', '『P.S.アイラヴユー』の原作者としても知られるセシリア・アハーンの「愛は虹の向こうに」を基に、友達以上恋人未満の男女の擦れ違いを描くラブストーリー。', '恋愛映画', 'Ssiecig9w60', 400),
    ('user_id_3', 'user_name_3', '恋と嘘', '映画『恋と嘘』は10月14日より全国公開', '恋愛映画', 'U_QWy7MDaUg', 100),
    ('user_id_3', 'user_name_3', '君に届け', '黒沼爽子は、見た目が暗く何もしていないのに周りから怖がられ、「貞子」というあだ名まで付けられている。', '恋愛映画', '8DNPhwwdfKE', 500),
    ('user_id_4', 'user_name_4', 'スノーホワイト', '世界中で愛されているグリム童話「白雪姫」を大胆にアレンジした、白雪姫と女王が死闘を繰り広げるアドベンチャー。', 'アドベンチャー映画', 'ZykOshHhJKw', 600),
    ('user_id_4', 'user_name_4', 'キングスマン', '全世界4億ドルのメガヒット！誰も見たことのない、キレッキレの超過激スパイアクションが誕生！', 'アドベンチャー映画', 'ohOnGe6Cha8', 300),
    ('user_id_4', 'user_name_4', 'ベイマックス', 'マーベルコミックスのヒット作「BIG HERO 6」を原基に、ディズニーが放つアドベンチャー。', 'アドベンチャー映画', 'pK8SqxfvoG8', 250),
    ('user_id_4', 'user_name_4', 'ユリゴコロ', '第14回大藪春彦賞を受賞し、第9回本屋大賞にもノミネートされた沼田まほかるのミステリー小説を映画化。', 'ミステリー映画', 'OZKJlvXa4gU', 550),
    ('user_id_2', 'user_name_2', 'フロッグ', '少年の失踪事件が相次ぐ街を舞台に、事件の担当刑事の家で異変が起きるサスペンススリラー。', 'ミステリー映画', 'wEPYgVmNXSM', 20),
    ('user_id_3', 'user_name_3', 'フローズン', '2010年夏、渋谷シネクイントほか全国公開', 'ミステリー映画', '9H2vyu87y7s', 100),
    ('user_id_3', 'user_name_3', 'ルイスと不思議の時計', 'ジョン・ベレアーズの児童文学を原作にしたファンタジー。', 'ファンタジー映画', 'eC0Qm4IxvYI', 100),
    ('user_id_3', 'user_name_3', 'ミス・ペレグリンと奇妙なこどもたち', 'かけがえのない愛おしさに満ちたダーク･ファンタジー！', 'ファンタジー映画', 'Y1oclwWuf6c', 300),
    ('user_id_3', 'user_name_3', 'ウォークラフト', '史上空前のスペクタクル・ファンタジー。2016年、壮大な物語が幕を開ける。', 'ファンタジー映画', '9vkYbxIrDyA', 300),
    ('user_id_3', 'user_name_3', 'マレフィセント', 'ディズニーアニメ『眠れる森の美女』ではオーロラ姫に呪いをかけた悪役だった、邪悪な妖精マレフィセントを主人公とするダークファンタジー。', 'ファンタジー映画', 'zs-mx9f38H4', 500)
;
